translit_dictionary = {
    # Русский, украинский и белорусский транслит
    'а': "a", 'б': "b", 'в': "v", 'г': "g", 'д': "d", 'е': "e", 'ё': "e", 'ж': "zh", 'з': "z",
    'и': "i", 'й': "j", 'к': "k", 'л': "l", 'м': "m", 'н': "n", 'о': "o", 'п': "p", 'р': "r",
    'с': "s", 'т': "t", 'у': "u", 'ф': "f", 'х': "h", 'ц': "c", 'ч': "ch", 'ш': "sh", 'щ': "shh",
    'ъ': "", 'ы': "y", 'ь': "", 'э': "je", 'ю': "ju", 'я': "ya", 'є': "je", 'і': "i", 'ї': "i",
    'ў': "w", '\'': "", '`': "",

    # Армянский транслит
    'ա': "a", 'բ': "b", 'գ': "g", 'դ': "d", 'ե': "e", 'զ': "z", 'է': "e", 'ը': "y", 'թ': "t",
    'ժ': "jh", 'ի': "i", 'լ': "l", 'խ': "x", 'ծ': "c", 'կ': "k", 'հ': "h", 'ձ': "d", 'ղ': "gh",
    'ճ': "tw", 'մ': "m", 'յ': "y", 'ն': "n", 'շ': "sh", 'ո': "o", 'չ': "ch", 'պ': "p", 'ջ': "j",
    'ռ': "r", 'ս': "s", 'վ': "v", 'տ': "t", 'ր': "r", 'ց': "c", 'ւ': "w", 'փ': "p", 'ք': "q",
    'օ': "o", 'ֆ': "f", 'և': "&",

    # Греческий транслит
    'α': "a", 'β': "b", 'γ': "g", 'δ': "d", 'ε': "e", 'ζ': "z", 'η': "h", 'θ': "th", 'ι': "i",
    'κ': "k", 'λ': "l", 'μ': "m", 'ν': "n", 'ξ': "x", 'ο': "o", 'π': "p", 'ρ': "r", 'σ': "s",
    'ς': "c", 'τ': "t", 'υ': "y", 'φ': "f", 'χ': "ch", 'ψ': "ps", 'ω': "w",

    # Грузинский транслит
    'ა': "a", 'ბ': "b", 'გ': "g", 'დ': "d", 'ე': "e", 'ვ': "v", 'ზ': "z", 'თ': "t", 'ი': "i",
    'კ': "k", 'ლ': "l", 'მ': "m", 'ნ': "n", 'ო': "o", 'პ': "p", 'ჟ': "zh", 'რ': "r", 'ს': "s",
    'ტ': "t", 'უ': "u", 'ფ': "p", 'ქ': "k", 'ღ': "gh", 'ყ': "q", 'შ': "sh", 'ჩ': "ch", 'ც': "ts",
    'ძ': "dz", 'წ': "ts", 'ჭ': "ch'", 'ხ': "kh", 'ჯ': "j", 'ჰ': "h",

    # Литовский транслит
    'ą': "aa", 'č': "cx", 'ę': "ee", 'ė': "ex", 'į': "ii", 'š': "sx", 'ų': "uu", 'ū': "ux", 'ž': "zx",

    # Таджикский транслит
    'ғ': "g", 'ӣ': "j", 'қ': "k", 'ӯ': "u", 'ҳ': "h", 'ҷ': "ch",

    # Казахский транслит
    'ә': "a", 'ң': "nh", 'ө': "o", 'ұ': "u", 'ү': "u", 'һ': "h",

    'ä': "ae", 'ö': "oe", 'ü': "yu", 'ß': "fs", 'ă': "je", 'â': "y", 'î': "y", 'ş': "sh", 'ţ': "c", 'ā': "a", 'ǟ': "a",
    'ḇ': "b", 'c̄': "c", 'ḏ': "d", 'ē': "e", 'ḕ': "e", 'ḗ': "e", 'ḡ': "g", 'ẖ': "h", 'ī': "i", 'ḹ': "l", 'ḻ': "l",
    'ṉ': "n", 'ō': "o", 'ȫ': "o", 'ṑ': "o", 'ṓ': "o", 'ṝ': "r", 'ṟ': "r", 'ṯ': "t", 'ǘ': "u", 'ǖ': "u", 'ṻ': "u",
    'ȳ': "y", 'ẕ': "z", 'ǣ': "ae", 'õ': "o", 'ə': "ae"
}


def translit(value):
    return ''.join([(translit_dictionary[c] if c in translit_dictionary else c) for c in value])
